share/man/man4/ekiss.4
.\"	$OpenBSD$
.\"
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\" Copyright (c) 2019 Iain R. Leamonth <irl@fsfe.org>
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     From:	@(#)lo.4	8.1 (Berkeley) 6/5/93
.\"
.Dd $Mdocdate: September 01 2019 $
.Dt KISS 4
.Os
.Sh NAME
.Nm ekiss
.Nd Ethernet-over-KISS network interface
.Sh SYNOPSIS
.Cd "pseudo-device ekiss"
.Sh DESCRIPTION
The
.Nm
interface allows serial lines to be used as network interfaces using the
.Em KISS protocol.
.Pp
A
.Nm
interface can be created at runtime using the
.Ic ifconfig kiss Ns Ar N Ic create
command or by setting up a
.Xr hostname.if 5
configuration file for
.Xr netstart 8 .
.Sh SEE ALSO
.Xr inet 4 ,
.Xr ldattach 8 ,
.Xr hostname.if 5 ,
.Xr ifconfig 8 ,
.Xr netstart 8
.Sh STANDARDS
.Bl -bullet
.It
.Rs
.%A Mike Chepponis, K3MC
.%A Phil Karn, KA9Q
.%D 1987
.%T The KISS TNC: A simple Host-to-TNC communications protocol
.%B ARRL 6th Computer Networking Conference
.%C Redondo Beach, CA, United States.
.Re
.It
.Rs
.%A Karl Medcalf, WK5M
.%D 1991
.%T Multi-Drop KISS operation
.%B ARRL 10th Computer Networking Conference
.%C San Jose, CA, United States.
.Re
.El
.Sh BUGS
Currently, too many to enumerate. Look out for TODO: entries in the codebase.
